<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<%@ include file="../common/head.jsp" %>
</head>
<body>
<%@ include file="../common/header.jsp" %>
	<div class="container px-0">
       <main>
        <h2 class="text-center">개인정보처리방침</h2>
       <div class="mt-5 p-4 rounded-3 border" style="white-space: pre-wrap;">
※ 본 개인정보처리방침은 해피기버즈(HAPPYGIVERS, 이하 "회사")가 운영하는 온라인 플랫폼 및 관련 서비스에서 회원 및 비회원의 개인정보를 어떻게 수집, 이용, 보호하는지에 대해 설명합니다.
해피기버즈는 "개인정보 보호법" 및 관련 법령을 철저히 준수합니다.

■ 수집하는 개인정보 항목 및 수집방법
가. 수집 항목
회사는 회원가입, 서비스 신청 및 후원/기부 이용을 위해 다음과 같은 개인정보를 수집합니다.
- 회원가입 시: 이름, 생년월일, 성별, 아이디(ID), 비밀번호, 휴대전화번호, 이메일
- 서비스 신청 시: 주소, 결제정보, 기부내역
- 기관회원 가입 시: 기관명, 담당자 연락처
- 선택항목: 닉네임, 주소, 전화번호, 프로필 이미지 등
- 서비스 이용 과정에서: 접속 IP, 접속 로그, 쿠키, 서비스 이용기록, 결제기록, 기부활동 내역

나. 수집방법
- 웹사이트 및 앱을 통한 회원가입, 기부신청, 이벤트 응모
- 문의하기, 이메일, 전화 상담, 배송요청 등 고객 응대 과정
- 자동 생성 정보 수집 도구를 통한 수집 (예: 쿠키, 로그 분석)

■ 개인정보의 수집 및 이용 목적
회사는 다음 목적에 한해 개인정보를 사용합니다.
- 회원 관리: 본인 확인, 중복 가입 방지, 탈퇴 요청 처리, 민원 응대, 기부자 인증
- 기부 및 후원 서비스 제공: 기부 신청 및 이력 관리, 기부 영수증 발급, 수혜처 정보 전달
- 콘텐츠 제공 및 맞춤형 서비스 제공
- 법령에 따른 의무 이행 및 사기 방지
- 마케팅 및 커뮤니케이션: 해피레터 발송, 기부 캠페인 안내, 기부자 스토리 공유 등

■ 개인정보의 보유 및 이용기간
원칙적으로 수집 및 이용 목적이 달성되면 해당 정보를 지체 없이 파기합니다.
단, 아래와 같이 일정 기간 보존합니다.

가. 해피기버즈 내부 방침에 따른 정보 보유
- 탈퇴 후 부정 이용 방지 및 분쟁 대응을 위해 3년간 보존

나. 관련 법령에 따른 보유
- 계약 및 청약철회 등에 관한 기록: 5년 (전자상거래법)
- 대금결제 및 재화공급에 관한 기록: 5년 (전자상거래법)
- 소비자 불만 또는 분쟁처리: 3년 (전자상거래법)
- 접속 로그: 3개월 (통신비밀보호법)

■ 개인정보의 파기절차 및 방법
- 전자적 정보: 복구 불가능한 기술적 방법으로 영구 삭제
- 서면 정보: 분쇄 또는 소각 방식으로 파기

■ 개인정보 제3자 제공
회사는 이용자의 사전 동의 없이는 개인정보를 외부에 제공하지 않으며, 다음과 같은 경우에만 예외로 제공합니다:
- 이용자의 명시적 동의가 있는 경우
- 법령에 의해 정당하게 요구되는 경우

■ 개인정보 처리위탁
회사는 원활한 서비스 제공을 위해 다음과 같은 외부업체에 위탁하고 있습니다.
- 택배사: 기부물품 배송
- PG사(전자결제사): 기부금 결제 대행
- 문자/이메일 발송업체: 알림/캠페인 발송 대행

■ 이용자 및 법정대리인의 권리와 행사 방법
- 회원은 언제든지 개인정보 열람, 정정, 삭제, 동의철회를 요청할 수 있습니다.
- 마이페이지 또는 고객센터를 통해 직접 요청 가능하며, 탈퇴 시 모든 정보는 관련 법령에 따라 처리 후 파기됩니다.

■ 개인정보 자동 수집 장치의 설치 및 거부
- 쿠키 수집 목적: 접속빈도 파악, 이용자 선호 분석, 맞춤 콘텐츠 제공
- 쿠키 차단 방법: 브라우저 설정에서 쿠키 사용 차단 설정 가능

■ 개인정보 보호 책임자 및 민원서비스
▶ 개인정보 보호책임자
성명: 송성준
직책: 데이터보호팀장
전화: 02-1234-5678
이메일: privacy@happygivers.org

▶ 민원 및 문의 접수처
고객센터: 02-1234-5678
이메일: support@happygivers.org

▶ 기타 신고 기관
개인정보침해신고센터: privacy.kisa.or.kr / 국번없이 118
개인정보분쟁조정위원회: kopico.go.kr / 1833-6972
경찰청 사이버범죄 신고시스템: cyberbureau.police.go.kr / 국번없이 182

■ 시행일
이 방침은 2025년 7월 10일부터 적용됩니다.
       </div>
      </main>
       
    </div>
<%@ include file="../common/footer.jsp" %>

</body>
</html>